## Plan Result (stg-global)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat"
        name                                         = "hmcts-aat"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-dn" -> "healthProbeSettings-plum"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/div-dn"
          ~ load_balancing_name = "loadBalancingSettings-div-dn" -> "loadBalancingSettings-plum"
          ~ name                = "div-dn" -> "plum"

          ~ backend {
              ~ host_header = "decree-nisi-aks.aat.platform.hmcts.net" -> "plum.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-da" -> "healthProbeSettings-div-dn"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/div-da"
          ~ load_balancing_name = "loadBalancingSettings-div-da" -> "loadBalancingSettings-div-dn"
          ~ name                = "div-da" -> "div-dn"

          ~ backend {
              ~ host_header = "decree-absolute-aks.aat.platform.hmcts.net" -> "decree-nisi-aks.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-rfe" -> "healthProbeSettings-div-da"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/div-rfe"
          ~ load_balancing_name = "loadBalancingSettings-div-rfe" -> "loadBalancingSettings-div-da"
          ~ name                = "div-rfe" -> "div-da"

          ~ backend {
              ~ host_header = "respond-divorce-aks.aat.platform.hmcts.net" -> "decree-absolute-aks.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-pfe" -> "healthProbeSettings-div-rfe"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/div-pfe"
          ~ load_balancing_name = "loadBalancingSettings-div-pfe" -> "loadBalancingSettings-div-rfe"
          ~ name                = "div-pfe" -> "div-rfe"

          ~ backend {
              ~ host_header = "petitioner-frontend-aks.aat.platform.hmcts.net" -> "respond-divorce-aks.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-pet-app1" -> "healthProbeSettings-div-pfe"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/pet-app1"
          ~ load_balancing_name = "loadBalancingSettings-pet-app1" -> "loadBalancingSettings-div-pfe"
          ~ name                = "pet-app1" -> "div-pfe"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-pet-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com"
              ~ host_header = "pet-app1.aat.platform.hmcts.net" -> "petitioner-frontend-aks.aat.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-pet-app2" -> "healthProbeSettings-pet-app1"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/pet-app2"
          ~ load_balancing_name = "loadBalancingSettings-pet-app2" -> "loadBalancingSettings-pet-app1"
          ~ name                = "pet-app2" -> "pet-app1"

          ~ backend {
              ~ host_header = "pet-app2.aat.platform.hmcts.net" -> "pet-app1.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-tribunals" -> "healthProbeSettings-pet-app2"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/sscs-tribunals"
          ~ load_balancing_name = "loadBalancingSettings-sscs-tribunals" -> "loadBalancingSettings-pet-app2"
          ~ name                = "sscs-tribunals" -> "pet-app2"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-aat.uksouth.cloudapp.azure.com" -> "firewall-prod-int-palo-pet-aat.uksouth.cloudapp.azure.com"
              ~ host_header = "benefit-appeal.aat.platform.hmcts.net" -> "pet-app2.aat.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-cor" -> "healthProbeSettings-sscs-tribunals"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/sscs-cor"
          ~ load_balancing_name = "loadBalancingSettings-sscs-cor" -> "loadBalancingSettings-sscs-tribunals"
          ~ name                = "sscs-cor" -> "sscs-tribunals"

          ~ backend {
              ~ host_header = "sscs-cor.aat.platform.hmcts.net" -> "benefit-appeal.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-tya" -> "healthProbeSettings-sscs-cor"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/sscs-tya"
          ~ load_balancing_name = "loadBalancingSettings-sscs-tya" -> "loadBalancingSettings-sscs-cor"
          ~ name                = "sscs-tya" -> "sscs-cor"

          ~ backend {
              ~ host_header = "track-appeal.aat.platform.hmcts.net" -> "sscs-cor.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-webapp" -> "healthProbeSettings-sscs-tya"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/xui-webapp"
          ~ load_balancing_name = "loadBalancingSettings-xui-webapp" -> "loadBalancingSettings-sscs-tya"
          ~ name                = "xui-webapp" -> "sscs-tya"

          ~ backend {
              ~ host_header = "manage-case.aat.platform.hmcts.net" -> "track-appeal.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-manage-org" -> "healthProbeSettings-xui-webapp"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/xui-manage-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-manage-org" -> "loadBalancingSettings-xui-webapp"
          ~ name                = "xui-manage-org" -> "xui-webapp"

          ~ backend {
              ~ host_header = "manage-org.aat.platform.hmcts.net" -> "manage-case.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-approve-org" -> "healthProbeSettings-xui-manage-org"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/xui-approve-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-approve-org" -> "loadBalancingSettings-xui-manage-org"
          ~ name                = "xui-approve-org" -> "xui-manage-org"

          ~ backend {
              ~ host_header = "administer-orgs.aat.platform.hmcts.net" -> "manage-org.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-register-org" -> "healthProbeSettings-xui-approve-org"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/xui-register-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-register-org" -> "loadBalancingSettings-xui-approve-org"
          ~ name                = "xui-register-org" -> "xui-approve-org"

          ~ backend {
              ~ host_header = "register-org.aat.platform.hmcts.net" -> "administer-orgs.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-civil-citizen-ui" -> "healthProbeSettings-xui-register-org"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/civil-citizen-ui"
          ~ load_balancing_name = "loadBalancingSettings-civil-citizen-ui" -> "loadBalancingSettings-xui-register-org"
          ~ name                = "civil-citizen-ui" -> "xui-register-org"

          ~ backend {
              ~ host_header = "civil-citizen-ui.aat.platform.hmcts.net" -> "register-org.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cmc" -> "healthProbeSettings-civil-citizen-ui"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/cmc"
          ~ load_balancing_name = "loadBalancingSettings-cmc" -> "loadBalancingSettings-civil-citizen-ui"
          ~ name                = "cmc" -> "civil-citizen-ui"

          ~ backend {
              ~ host_header = "moneyclaims.aat.platform.hmcts.net" -> "civil-citizen-ui.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cmc-legal" -> "healthProbeSettings-cmc"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/cmc-legal"
          ~ load_balancing_name = "loadBalancingSettings-cmc-legal" -> "loadBalancingSettings-cmc"
          ~ name                = "cmc-legal" -> "cmc"

          ~ backend {
              ~ host_header = "moneyclaims-legal.aat.platform.hmcts.net" -> "moneyclaims.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fact" -> "healthProbeSettings-cmc-legal"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fact"
          ~ load_balancing_name = "loadBalancingSettings-fact" -> "loadBalancingSettings-cmc-legal"
          ~ name                = "fact" -> "cmc-legal"

          ~ backend {
              ~ host_header = "fact.aat.platform.hmcts.net" -> "moneyclaims-legal.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fact-admin" -> "healthProbeSettings-fact"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/fact-admin"
          ~ load_balancing_name = "loadBalancingSettings-fact-admin" -> "loadBalancingSettings-fact"
          ~ name                = "fact-admin" -> "fact"

          ~ backend {
              ~ host_header = "fact-admin.aat.platform.hmcts.net" -> "fact.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-rpts" -> "healthProbeSettings-fact-admin"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/rpts"
          ~ load_balancing_name = "loadBalancingSettings-rpts" -> "loadBalancingSettings-fact-admin"
          ~ name                = "rpts" -> "fact-admin"

          ~ backend {
              ~ host_header = "rpts.aat.platform.hmcts.net" -> "fact-admin.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-nfdiv" -> "healthProbeSettings-rpts"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/nfdiv"
          ~ load_balancing_name = "loadBalancingSettings-nfdiv" -> "loadBalancingSettings-rpts"
          ~ name                = "nfdiv" -> "rpts"

          ~ backend {
              ~ host_header = "nfdiv.aat.platform.hmcts.net" -> "rpts.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-et-sya" -> "healthProbeSettings-nfdiv"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/et-sya"
          ~ load_balancing_name = "loadBalancingSettings-et-sya" -> "loadBalancingSettings-nfdiv"
          ~ name                = "et-sya" -> "nfdiv"

          ~ backend {
              ~ host_header = "et-sya.aat.platform.hmcts.net" -> "nfdiv.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-ia-aip" -> "healthProbeSettings-et-sya"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/ia-aip"
          ~ load_balancing_name = "loadBalancingSettings-ia-aip" -> "loadBalancingSettings-et-sya"
          ~ name                = "ia-aip" -> "et-sya"

          ~ backend {
              ~ host_header = "immigration-appeal.aat.platform.hmcts.net" -> "et-sya.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-wa-proto-frontend" -> "healthProbeSettings-ia-aip"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/wa-proto-frontend"
          ~ load_balancing_name = "loadBalancingSettings-wa-proto-frontend" -> "loadBalancingSettings-ia-aip"
          ~ name                = "wa-proto-frontend" -> "ia-aip"

          ~ backend {
              ~ host_header = "wa-proto-frontend.aat.platform.hmcts.net" -> "immigration-appeal.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-gateway-ccd" -> "healthProbeSettings-wa-proto-frontend"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/gateway-ccd"
          ~ load_balancing_name = "loadBalancingSettings-gateway-ccd" -> "loadBalancingSettings-wa-proto-frontend"
          ~ name                = "gateway-ccd" -> "wa-proto-frontend"

          ~ backend {
              ~ host_header = "gateway-ccd.aat.platform.hmcts.net" -> "wa-proto-frontend.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-return-case-doc-ccd" -> "healthProbeSettings-gateway-ccd"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/return-case-doc-ccd"
          ~ load_balancing_name = "loadBalancingSettings-return-case-doc-ccd" -> "loadBalancingSettings-gateway-ccd"
          ~ name                = "return-case-doc-ccd" -> "gateway-ccd"

          ~ backend {
              ~ host_header = "return-case-doc-ccd.aat.platform.hmcts.net" -> "gateway-ccd.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-pcq" -> "healthProbeSettings-return-case-doc-ccd"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/pcq"
          ~ load_balancing_name = "loadBalancingSettings-pcq" -> "loadBalancingSettings-return-case-doc-ccd"
          ~ name                = "pcq" -> "return-case-doc-ccd"

          ~ backend {
              ~ host_header = "pcq.aat.platform.hmcts.net" -> "return-case-doc-ccd.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-lau" -> "healthProbeSettings-pcq"
            id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/backendPools/lau"
          ~ load_balancing_name = "loadBalancingSettings-lau" -> "loadBalancingSettings-pcq"
          ~ name                = "lau" -> "pcq"

          ~ backend {
              ~ host_header = "lau.aat.platform.hmcts.net" -> "pcq.aat.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ h

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

2298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/fact-adminHttpsRedirect"
          ~ name               = "fact-adminHttpsRedirect" -> "cmc-legalHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "rpts",
              + "fact",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/rptsHttpsRedirect"
          ~ name               = "rptsHttpsRedirect" -> "factHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv",
              + "fact-admin",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/nfdivHttpsRedirect"
          ~ name               = "nfdivHttpsRedirect" -> "fact-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv-apply",
              + "rpts",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/nfdiv-applyHttpsRedirect"
          ~ name               = "nfdiv-applyHttpsRedirect" -> "rptsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv-civil",
              + "nfdiv",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/nfdiv-civilHttpsRedirect"
          ~ name               = "nfdiv-civilHttpsRedirect" -> "nfdivHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-sya",
              + "nfdiv-apply",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/et-syaHttpsRedirect"
          ~ name               = "et-syaHttpsRedirect" -> "nfdiv-applyHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ia-aip",
              + "nfdiv-civil",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/ia-aipHttpsRedirect"
          ~ name               = "ia-aipHttpsRedirect" -> "nfdiv-civilHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wa-proto-frontend",
              + "et-sya",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/wa-proto-frontendHttpsRedirect"
          ~ name               = "wa-proto-frontendHttpsRedirect" -> "et-syaHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "gateway-ccd",
              + "ia-aip",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/gateway-ccdHttpsRedirect"
          ~ name               = "gateway-ccdHttpsRedirect" -> "ia-aipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "return-case-doc-ccd",
              + "wa-proto-frontend",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/return-case-doc-ccdHttpsRedirect"
          ~ name               = "return-case-doc-ccdHttpsRedirect" -> "wa-proto-frontendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq",
              + "gateway-ccd",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/pcqHttpsRedirect"
          ~ name               = "pcqHttpsRedirect" -> "gateway-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau",
              + "return-case-doc-ccd",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/lauHttpsRedirect"
          ~ name               = "lauHttpsRedirect" -> "return-case-doc-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption",
              + "pcq",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/adoptionHttpsRedirect"
          ~ name               = "adoptionHttpsRedirect" -> "pcqHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption-web",
              + "lau",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/adoption-webHttpsRedirect"
          ~ name               = "adoption-webHttpsRedirect" -> "lauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "probate",
              + "adoption",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/probateHttpsRedirect"
          ~ name               = "probateHttpsRedirect" -> "adoptionHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "adoption-web",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "adoption-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paybubble",
              + "probate",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/paybubbleHttpsRedirect"
          ~ name               = "paybubbleHttpsRedirect" -> "probateHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "bar",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/barHttpsRedirect"
          ~ name               = "barHttpsRedirect" -> "idam-web-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fees-register",
              + "paybubble",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/fees-registerHttpsRedirect"
          ~ name               = "fees-registerHttpsRedirect" -> "paybubbleHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "bar",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "barHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "fees-register",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "fees-registerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscanstg",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/reformscanstgHttpsRedirect"
          ~ name               = "reformscanstgHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ds-ui",
              + "reformscan",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/ds-uiHttpsRedirect"
          ~ name               = "ds-uiHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fis-ds-web",
              + "reformscanstg",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/fis-ds-webHttpsRedirect"
          ~ name               = "fis-ds-webHttpsRedirect" -> "reformscanstgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "privatelaw",
              + "ds-ui",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/privatelawHttpsRedirect"
          ~ name               = "privatelawHttpsRedirect" -> "ds-uiHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "fis-ds-web",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "fis-ds-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "privatelaw",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "privatelawHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paymentoutcome-web",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/paymentoutcome-webHttpsRedirect"
          ~ name               = "paymentoutcome-webHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaymentoutcome-web",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/routingRules/paymentoutcome-webwwwRedirect"
          ~ name               = "paymentoutcome-webwwwRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paymentoutcome-web.aat.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "paymentoutcome-web",
            ]
          + name               = "paymentoutcome-webHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpaymentoutcome-web",
            ]
          + name               = "paymentoutcome-webwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.aat.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["plum"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/frontendEndpoints/plum"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["plum"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "plumaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1233,"Program":"tfcmt","SHA1":"","Target":"stg-global","Vars":{}} -->